app/controllers/post_controller.rb

SELECT "posteds".* FROM "posteds"
---
  def index
    @posts = Posted.all